---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextAlignVert
source: html/95b27dbd-c30d-94c8-8be9-d78daa6eb699.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextAlignVert Property

"Vertical Align"

## Syntax (C#)
```csharp
public static ForgeTypeId TextAlignVert { get; }
```